---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTable.IsValidColumnIndex(System.Int32)
source: html/d444a886-4f01-8cf6-2cb6-9b715fd271b1.htm
---
# Autodesk.Revit.DB.FamilySizeTable.IsValidColumnIndex Method

Checks if the column index is valid.

## Syntax (C#)
```csharp
public bool IsValidColumnIndex(
	int index
)
```

## Parameters
- **index** (`System.Int32`) - The index of the column.

## Returns
True if the column index is valid, false otherwise.